[
    {
        "text": "Jakarta: Rockstar Games meminta maaf lantaran GTA Trilogy: Definitive Edition membuat kecewa para gamer. Gim yang diluncurkan pada 11 November 2021 lalu itu banjir keluhan karena bug yang melimpah. “Pertama, kami ingin meminta maaf dengan tulus kepada semua orang yang mengalami masalah saat memainkan game ini,” tulis Rockstar seperti dikutip Medcom.id, Minggu, 21 November 2021. Rockstar mengakui game yang terdiri dari remaster tiga GTA ikonik yakni, GTA San Andreas. GTA Vice City, dan GTA III ini jauh dari standar mereka. Bahkan, tidak sesuai ekspektasi gamer yang ingin bernostalgia dengan game klasik tersebut dengan peningkatan visual yang ciamik. “Versi terbaru dari game klasik ini tidak diluncurkan dalam keadaan yang memenuhi standar kualitas kami sendiri, atau standar yang diharapkan oleh penggemar kami,” ungkap mereka. Memang, Rockstar Games menjanjikan tiga games tersebut dikemas apik secara visual dan kontrol terbaru. Sehingga, pemain bisa mendapatkan pengalaman terbaik ketika bermain game ini. “Ketiga game yang termasuk dalam Grand Theft Auto: The Trilogy – The Definitive Edition juga menampilkan peningkatan khusus termasuk Gyro aiming dan zoom kamera layar sentuh, pilihan pan dan menu di Nintendo Switch, dukungan resolusi 4K dengan kinerja hingga 60 FPS untuk Sistem PlayStation 5 dan Xbox Series X, dan dukungan NVIDIA DLSS untuk PC,” tulis Rockstar."
    }, {
        "text": "Terkait isu teknis yang dikeluhkan para pemain, pihak Rockstar Games telah menyiapkan pembaruan. Mereka menyebut pembaruan tersebut akan membuat game ini pada kualitas yang layak. Untuk kapan update tersebut akan dirilis Rockstar Games belum memberi tanggal pasti. “Pembaruan Judul baru sedang pengerjaan dalam beberapa hari mendatang untuk semua versi Grand Theft Auto: The Trilogy – The Definitive Edition yang akan mengatasi sejumlah masalah,” terangnya. Selain menjanjikan pembaruan, mereka juga akan mengembalikan menambahkan versi PC klasik dari tiga game tersebut kembali ke Rockstar Store. Pengguna yang telah membeli Grand Theft Auto: The Trilogy – The Definitive Edition untuk PC dari Rockstar Store hingga 30 Juni 2022, akan menerima versi klasik ini di pustaka Rockstar Games Launcher secara gratis."
    }
]